In [1]:
import pandas as pd

In [7]:
# Bringing in the WS Data

win_share_df = pd.read_csv("../Datasets/win_share.csv") 
win_share_df = win_share_df[['Player', 'WS']]
win_share_df

                     Player    WS
0                A.C. Green  94.6
1             A.J. Bramlett  -0.2
2              A.J. English   1.1
3               A.J. Guyton   0.3
4              A.J. Hammons   0.0
...                     ...   ...
3277  Šarūnas Marčiulionis*   3.8
3278              Žan Tabak   2.4
3279        Žarko ?abarkapa  -0.1
3280          Žarko Paspalj  -0.3
3281         Željko Rebra?a   7.7

[3282 rows x 2 columns]

In [9]:
# Bringing in the Hometown Data
hometown_df = pd.read_csv("../nba_hometown_data.csv") 

hometown_df.rename(columns = {'birth_state':'Birth_Place'}, inplace = True) 

hometown_df

                 Player             Birth_Place
0          Cliff Barker                 Indiana
1           Ralph Beard                Kentucky
2         Charlie Black                   Idaho
3           Nelson Bobb            Pennsylvania
4       Jake Bornheimer              New Jersey
...                 ...                     ...
3434      Troy Williams          South Carolina
3435       Kyle Wiltjer                  Oregon
3436  Stephen Zimmerman               Tennessee
3437        Paul Zipser                 Germany
3438        Ivica Zubac  Bosnia and Herzegovina

[3439 rows x 2 columns]

In [16]:
heatmap_df = pd.merge(win_share_df, hometown_df, on='Player', how = 'inner')
heatmap_df

                  Player    WS Birth_Place
0           Aaron Brooks  15.1  Washington
1           Aaron Gordon  21.8  California
2             Aaron Gray   5.1  California
3         Aaron Harrison  -0.2       Texas
4            Aaron James   8.1   Louisiana
...                  ...   ...         ...
2702       Zach Randolph  78.3     Indiana
2703     Zaid Abdul-Aziz   0.4    New York
2704       Zaza Pachulia  52.6     Georgia
2705     Zendon Hamilton   3.0    New York
2706  Zydrunas Ilgauskas  66.4   Lithuania

[2707 rows x 3 columns]

In [18]:
heatmap_df = heatmap_df[['Birth_Place', 'WS']]
heatmap_df

     Birth_Place    WS
0     Washington  15.1
1     California  21.8
2     California   5.1
3          Texas  -0.2
4      Louisiana   8.1
...          ...   ...
2702     Indiana  78.3
2703    New York   0.4
2704     Georgia  52.6
2705    New York   3.0
2706   Lithuania  66.4

[2707 rows x 2 columns]

In [22]:
heatmap_df = heatmap_df.groupby(['Birth_Place']).sum().reset_index()
heatmap_df

       Birth_Place      WS
0          Alabama  1291.3
1           Alaska    28.5
2        Argentina    93.2
3          Arizona   100.6
4         Arkansas   714.4
..             ...     ...
111       Virginia  1006.8
112     Washington   779.2
113  West Virginia    83.2
114      Wisconsin   438.4
115        Wyoming    23.1

[116 rows x 2 columns]

In [20]:
heatmap_df.to_csv('../Datasets/birthplace_ws.csv', index=False)

In [73]:
# Bringing in the Coordinates Data
coord_df = pd.read_csv("../Datasets/world_country_and_usa_states_latitude_and_longitude_values.csv") 



coord_df

,country_code,latitude,longitude,country,usa_state_code,usa_state_latitude,usa_state_longitude,usa_state
0,AD,42.546245,1.601554,Andorra,AK,63.588753,-154.493062,Alaska
1,AE,23.424076,53.847818,United Arab Emirates,AL,32.318231,-86.902298,Alabama
2,AF,33.939110,67.709953,Afghanistan,AR,35.201050,-91.831833,Arkansas
3,AG,17.060816,-61.796428,Antigua and Barbuda,AZ,34.048928,-111.093731,Arizona
4,AI,18.220554,-63.068615,Anguilla,CA,36.778261,-119.417932,California
...,...,...,...,...,...,...,...,...
240,YE,15.552727,48.516388,Yemen,NaN,NaN,NaN,NaN
241,YT,-12.827500,45.166244,Mayotte,NaN,NaN,NaN,NaN
242,ZA,-30.559482,22.937506,South Africa,NaN,NaN,NaN,NaN
243,ZM,-13.133897,27.849332,Zambia,NaN,NaN,NaN,NaN
244,ZW,-19.015438,29.154857,Zimbabwe,NaN,NaN,NaN,NaN

In [74]:
country_df = coord_df[['latitude', 'longitude', 'country']].copy()
state_df = coord_df[['usa_state_latitude', 'usa_state_longitude', 'usa_state']].copy()

In [75]:
country_df.rename(columns = {'country':'Birth_Place'}, inplace = True)

country_df = country_df.dropna()

country_df

      latitude  longitude           Birth_Place
0    42.546245   1.601554               Andorra
1    23.424076  53.847818  United Arab Emirates
2    33.939110  67.709953           Afghanistan
3    17.060816 -61.796428   Antigua and Barbuda
4    18.220554 -63.068615              Anguilla
..         ...        ...                   ...
240  15.552727  48.516388                 Yemen
241 -12.827500  45.166244               Mayotte
242 -30.559482  22.937506          South Africa
243 -13.133897  27.849332                Zambia
244 -19.015438  29.154857              Zimbabwe

[244 rows x 3 columns]

In [76]:
state_df.rename(columns = {'usa_state':'Birth_Place', 'usa_state_latitude':'latitude', 'usa_state_longitude':'longitude'}, inplace = True)

state_df = state_df.dropna()

state_df

     latitude   longitude           Birth_Place
0   63.588753 -154.493062                Alaska
1   32.318231  -86.902298               Alabama
2   35.201050  -91.831833              Arkansas
3   34.048928 -111.093731               Arizona
4   36.778261 -119.417932            California
5   39.550051 -105.782067              Colorado
6   41.603221  -73.087749           Connecticut
7   38.905985  -77.033418  District of Columbia
8   38.910832  -75.527670              Delaware
9   27.664827  -81.515754               Florida
10  32.157435  -82.907123               Georgia
11  19.898682 -155.665857                Hawaii
12  41.878003  -93.097702                  Iowa
13  44.068202 -114.742041                 Idaho
14  40.633125  -89.398528              Illinois
15  40.551217  -85.602364               Indiana
16  39.011902  -98.484246                Kansas
17  37.839333  -84.270018              Kentucky
18  31.244823  -92.145024             Louisiana
19  42.407211  -71.382437         Massachusetts
20  39.045755  -76.641271              Maryland
21  45.253783  -69.445469                 Maine
22  44.314844  -85.602364              Michigan
23  46.729553  -94.685900             Minnesota
24  37.964253  -91.831833              Missouri
25  32.354668  -89.398528           Mississippi
26  46.879682 -110.362566               Montana
27  35.759573  -79.019300        North Carolina
28  47.551493 -101.002012          North Dakota
29  41.492537  -99.901813              Nebraska
30  43.193852  -71.572395         New Hampshire
31  40.058324  -74.405661            New Jersey
32  34.972730 -105.032363            New Mexico
33  38.802610 -116.419389                Nevada
34  43.299428  -74.217933              New York
35  40.417287  -82.907123                  Ohio
36  35.007752  -97.092877              Oklahoma
37  43.804133 -120.554201                Oregon
38  41.203322  -77.194525          Pennsylvania
39  18.220833  -66.590149           Puerto Rico
40  41.580095  -71.477429          Rhode Island
41  33.836081  -81.163725        South Carolina
42  43.969515  -99.901813          South Dakota
43  35.517491  -86.580447             Tennessee
44  31.968599  -99.901813                 Texas
45  39.320980 -111.093731                  Utah
46  37.431573  -78.656894              Virginia
47  44.558803  -72.577841               Vermont
48  47.751074 -120.740139            Washington
49  43.784440  -88.787868             Wisconsin
50  38.597626  -80.454903         West Virginia
51  43.075968 -107.290284               Wyoming

In [77]:
coordinates_df = pd.merge(country_df, state_df, how = 'outer')
coordinates_df.head()

    latitude  longitude           Birth_Place
0  42.546245   1.601554               Andorra
1  23.424076  53.847818  United Arab Emirates
2  33.939110  67.709953           Afghanistan
3  17.060816 -61.796428   Antigua and Barbuda
4  18.220554 -63.068615              Anguilla

In [79]:
master_heatmap_df = pd.merge(heatmap_df, coordinates_df, on = 'Birth_Place')

master_heatmap_df.to_csv('../Datasets/final_heatmap.csv', index=False)

In [80]:
# Creating an object from the DF
for index, row in master_heatmap_df.iterrows():
        heatmap = {
            'birthplace': row['Birth_Place'],
            'win_shares': row['WS'],
            'long': row['longitude'],
            'lat': row['latitude'], 
        }

In [81]:
# Viewing the object
heatmap

{'birthplace': 'Wyoming',
 'win_shares': 23.099999999999998,
 'long': -107.29028400000001,
 'lat': 43.075967999999996}